{"pageProps":{"postData":{"id":["2010","07","31","firebird-10th-anniversary-how-i-came-to"],"contentHtml":"<p>July 31th, 2010. Today <a href=\"http://www.firebirdsql.org/\">Firebird</a> completes its 10th anniversary. The Firebird website has a set of <a href=\"http://firebirdsql.org/index.php?op=history\">history documents</a> about how that started. It’s something you must read if you’re interested in Firebird.<br /><br />I’m sometimes asked about how I became one of its team members. So I’m going to tell something about this.<br /><br />First things first. My first contact with InterBase was with the one present in the Delphi 3 CD. Searches says it was InterBase 4.2. I must say I didn’t like it too much. But my main problem at the time was with SQL. Not with its syntax, but with the idea of manipulating a database with text commands, and not via an API in a programming language. Fortunately, I was a child and grew up since then. :-)<br /><br />The second important thing I remember about InterBase was about it becoming open source. This was something I liked, but just forgot soon later.<br /><br />Then sometime later I came to the <a href=\"http://info.abril.com.br/downloads\">Info</a> download site and it had Firebird with a text saying something like “Download it, while it’s free”. I downloaded it (the 1.0 version) and saw on its website that there was no plan to make it non-free. I started using and liked it. What most attracted me was it excellent transaction control mechanism.<br /><br />I then started using the 1.5 RC versions and found a security bug on it. I tried to report on the SourceForge bug tracker without success. So I subscribed myself to firebird-devels mailing list and reported it there. That happened around in December 2003, and I never leaved the list since then. :-)<br /><br />Lurking at firebird-devel was a challenge. I didn’t understand much English nor the technical talks, but I stayed there reading every message. I started to read the source code and understand the subsystems. I then started following firebird-checkins mailing list, where I could better understand how each feature/fix got implemented.<br /><br />Around July 2004, I joined the Firebird PT_BR project to adapt for Firebird 1.5 the Brazilian collation done by Paulo Henrique Albanez for Firebird 1.0. I proposed different approach to definitively integrate it in Firebird and it was also rejected. So I got the work to do the “right” changes to the Firebird International Language (INTL) subsystem. In September 2004 I officially joined the project.<br /><br />What’s more nice about being there is that I can work with very competent team, delivering a good software to millions of people. And just doing something I really like, designing features, programming in C++ and working with compiler (SQL / PSQL) implementation...<br /><br />Long live Firebird!</p>\n","layout":"post","title":"Firebird 10th anniversary. How I came to it.","date":"2010-07-31T14:31:00.002-03:00","author":"Adriano dos Santos Fernandes","tags":["firebird"],"modified_time":"2010-07-31T14:39:35.548-03:00","blogger_id":"tag:blogger.com,1999:blog-3443854162607009076.post-7547937172084628787","blogger_orig_url":"http://asfernandes.blogspot.com/2010/07/firebird-10th-anniversary-how-i-came-to.html"}},"__N_SSG":true}