{"pageProps":{"postData":{"id":["2010","10","04","firebird-25-introduces-new-audit"],"contentHtml":"<p>October 4, 2010<br /><br />The Firebird Project today announces Firebird 2.5, the fifth and newest major release of its open source relational database management system. Enhancements in this new release are pitched at better serving the needs of businesses of any scale, from embedded device to enterprise resource planning solutions.<br /><br />Philippe Makowski, President of the non-profit <a href=\"http://www.firebirdsql.org/pop/index.php?op=ffoundation\">Firebird Foundation</a> observes that the Firebird 2.5 release is a very important step in Firebird's 10th anniversary year, not just for the Firebird Project but for the whole open-source world, too.<br /><br />\"Today businesses all around the world are looking for mature, cost-effective solutions and Firebird 2.5 offers them a solution that is truly powerful and truly free\", he noted.<br /><br />The mix of high performance, small footprint, supreme scalability, silent and simple installation and royalty-free deployment make Firebird a highly attractive choice for all types of software developers and vendors. Firebird deployments are well established around the globe, serving data to hundreds of thousands of business systems with hundreds of users and databases exceeding 300GB.<br /><br />Known Firebird installations number more than 2,000 each day, according to download statistics.<br /><br />\"Many of our customers have Firebird databases with sizes from 200GB to 400GB and they keep growing\", said Stewart Spink, CTO of <a href=\"http://www.watermarktech.co.uk/\">Watermark Software</a>. \"The performance improvements in Firebird 2.5 will ensure that their future demands will be satisfied completely.\"<br /><br />Alexander Shaposhnikov, CIO of medical distributor <a href=\"http://www.profitmed.net/\">Profitmed</a> predicts that Firebird 2.5 will support the growth of Profitmed's business. \"Currently we have a 65Gb database and 250 active users working 24x7. We intend to double both the size of the database and the number of users in two years and we have chosen Firebird 2.5 for this business-critical task.\"<br /><br />Firebird binaries are distributed for a variety of system and hardware platforms: Windows, Linux, MacOS, Solaris, HP-UX and more. Firebird runs on on x86, x64, PowerPC, Sparc and other hardware platforms, providing an easy migration mechanism between these diverse platforms.<br /><br />The V.2.5 release binaries ship for 32-bit and 64-bit Windows and Linux, with MacOSX x86 to follow. Other POSIX platform builds are likely to appear before the year is out, in response to demand.<br /><br />New features of Firebird 2.5<br /><ul><li>New SuperClassic Architecture  Firebird 2.5 introduces a new architecture, tagged \"SuperClassic\", to gain better leverage from multi-core and multi-CPU hardware environments and improve resource usage for systems with large numbers of users and huge databases.</li></ul><ul><li>Audit  System audit tracing and user trace sessions via the Services API enable nearly real-time monitoring and analysis of everything going on in a database</li></ul><ul><li>Cross-database queries  Firebird 2.5 opens the way for Firebird database instances to query one another and to exchange information</li></ul><ul><li>Enhanced user management  User management becomes accessible and flexible through SQL requests submitted from user databases</li></ul><ul><li>Other features include autonomous transactions within PSQL modules (stored procedures, triggers, SQL blocks), support for regular expressions as arguments in SQL using the SIMILAR TO predicate, asynchronous cancellation of connections, enhancements of monitoring capabilities and much more.</li></ul>Paul Beach, President and CEO of <a href=\"http://www.ibphoenix.com/\">IBPhoenix</a>, an organisation that offers professional services and contributes to Firebird development, considers the new security features and the impressive scaling capability of Firebird 2.5 will be welcomed by many existing Firebird users.<br /><br />\"In particular, it will help those in the finance and health industries to meet the growing requirements of their businesses\", he notes, \"especially in pushing the limits of performance.\"<br /><br />David Wilder, CTO of <a href=\"http://www.basx.com.au/\">Bas-X</a>, welcomed the Firebird 2.5 release for its improved useability and flexibility. \"It will enable our customers to turn over more transactions and run more concurrent users on the same hardware,\" he said.<br /><br /><b>Pricing and Availability</b><br /><br />Firebird 2.5 is an open source database system that is available free of charge for any kind of usage, be it commercial, educational, non-profit or simply for private use. Both binary packages and the complete source code can be <a href=\"http://www.firebirdsql.org/index.php?op=files&amp;id=engine_250\">downloaded</a> at no cost through the Firebird Project website for immediate installation. No registration or activation is required.<br /><br /><b>About the Firebird Foundation</b><br /><br />The <a href=\"http://www.firebirdsql.org/index.php?op=ffoundation\">Firebird Foundation</a> is a non-profit organization with the goal to support the development and growth of the Firebird relational database system. The Foundation was incorporated in 2002 and is currently supported by more than <a href=\"http://www.firebirdsql.org/index.php?op=ffoundation&amp;id=members_alpha\">300 active members</a>, several of whom are also <a href=\"http://www.firebirdsql.org/index.php?op=ffoundation&amp;id=sponsorship\">cash sponsors</a>. It also accepts and manages donations of cash and resources from persons and organisations that are not regular members. The Foundation redistributes these funds as grants to some of the key workers in the Firebird Project. The Firebird Project has no other source of income.<br /><br />Media Contact: Alexey Kovyazin * +7 910 402 94 34 * admin AT mindthebird DOT com</p>\n","layout":"post","title":"Firebird 2.5 Introduces New Audit Features and Improved Scalability","date":"2010-10-04T21:16:00.009-03:00","author":"Adriano dos Santos Fernandes","tags":["firebird"],"modified_time":"2010-10-04T21:36:38.904-03:00","blogger_id":"tag:blogger.com,1999:blog-3443854162607009076.post-8666045115153500056","blogger_orig_url":"http://asfernandes.blogspot.com/2010/10/firebird-25-introduces-new-audit.html"}},"__N_SSG":true}