{"pageProps":{"postData":{"id":["2009","11","02","ubuntu-910-review"],"contentHtml":"<p>I've upgraded Ubuntu 9.04 to 9.10, and here is what I found about it.</p>\n<p>At upgrade start, it asked about keyboard. Surprisingly, it has nothing about Brazilian keyboards and I choose to maintain \"kernel keymaps\" without know what exactly that is and why that keyboard popup appeared.</p>\n<p>During the upgrade, flash_plugin and package_hook updates crashed. Nvidia driver, as always failed too. So after restarting in safe mode, I changed nvidia driver to nv to be able to enter in the graphical mode.</p>\n<p>Then, to fix the system:</p>\n<div class=\"remark-highlight\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">sudo</span> <span class=\"token function\">aptitude</span> safe-upgrade\n<span class=\"token function\">sudo</span> <span class=\"token function\">aptitude</span> safe-upgrade\n<span class=\"token function\">sudo</span> <span class=\"token function\">aptitude</span> dist-upgrade\n</code></pre></div>\n<p>And reverted to nvidia driver.</p>\n<p>They claim to have new beautiful and faster boot. Lies. The new boot screen is horrible, specially when running fsck. And appears to be slower than in 9.04.</p>\n<p>The \"fast user switch\" gnome applet do not exist as before. It can't show your IM status anymore, nor can be compact as before. I changed it by the shutdown applet to have the same functionality that I used to have.</p>\n<p>As with Ubuntu 9.04, Firefox 3.5 continues slow as the 9.04 Shiretoko in my system. And the flash plugin continue crashing. I use the AMD64 version, which requires wrapper to 32 bit flash, because Adobe didn't released the final AMD64 version yet.</p>\n<p>Resuming, you decide. I want an updated system anyway. 😃</p>\n","layout":"post","title":"Ubuntu 9.10 review","published":true,"date":"2009-11-02T14:44:00.001-02:00","author":"Adriano dos Santos Fernandes","tags":["linux"],"modified_time":"2009-11-02T14:44:33.233-02:00"}},"__N_SSG":true}