{"pageProps":{"postData":{"id":["2015","01","22","corrigindo-schemas-do-web-service"],"contentHtml":"<p>Na <a href=\"http://www.nfe.fazenda.gov.br/portal/exibirArquivo.aspx?conteudo=2Z%20kcHOdpHs=\">Nota Técnica 2014/002</a> da Nota Fiscal Eletrônica, o governo <del>brasileiro</del> do PT, <del>por falta do que fazer</del> com o intuito de evoluir o sistema, substituiu o web service de consulta de NF-e emitidas por terceiros pelo web service de distribuição de documentos fiscais.</p>\n<p>Definiram que a partir de 06/10/2014 o novo web service já estaria funcionando no ambiente de produção, enquanto o antigo seria desativado em 02/02/2015. Estava tentando há duas semanas usar o novo web service e ele ainda não funcionava. Hoje consegui.</p>\n<p>O web service retornou resposta, mas é claro, resposta errada que não é validada pelo próprio <a href=\"http://www.nfe.fazenda.gov.br/portal/exibirArquivo.aspx?conteudo=cI%202zLXpcts=\">schema</a> distribuído por eles. Como uso Java com JAXB, após desativar a validação da resposta, o conteúdo do arquivo não estava sendo \"desserializado\" corretamente.</p>\n<p>Eles criaram uma tag DocZip que armazena um XML compactado com GZIP no formato BASE-64 e declararam o conteúdo da tag como se tivesse um documento XML. É óbvio que algo em BASE-64 não é um XML válido.</p>\n<p>Como o governo incompetente não testa o que faz, tive que corrigir o schema e estou disponibilizando para que outros também não percam tempo. Mesmo sem saber escrever schemas XML, cheguei <a href=\"http://stackoverflow.com/questions/376582/xml-schema-element-with-attributes-containing-only-text\">nessa dúvida</a> que me ajudou a fazer a correção.</p>\n<p><a href=\"http://pastebin.com/bNRspBSd\">Link para o arquivo retDistDFeInt_v1.00.xsd corrigido</a></p>\n<p><a href=\"http://pastebin.com/8c1RSCKZ\">Link para o diff/patch contra o arquivo XSD original</a></p>\n<p>Edit:</p>\n<p>Se tem uma coisa pior que incompetência que acontece com muita frequência na Receita Federal do PT ultimamente é a sacanagem. Após escrever esse artigo, mandei a mesma informação através do Fale Conosco, e antes mesmo de obter resposta (geralmente é um robô que responde algo sem sentido), desconfiei de uma coisa e fui verificar.</p>\n<p>A Receita Federal, na tentativa de esconder seus erros, costuma lançar correções de arquivos e disponibilizá-los com o mesmo número de versão. E não é que aconteceu exatamente isso agora?</p>\n<p>Tenho o arquivo PL_NFeDistDFe_100.zip com data de 07/01/2015 que tinha o problema. O arquivo presente <a href=\"http://www.nfe.fazenda.gov.br/portal/listaConteudo.aspx?tipoConteudo=/fwLvLUSmU8=\">nesta página</a> nesse momento tem o mesmo nome e diz que foi atualizado em 19/09/2014, porém ele já está corrigido!</p>\n","layout":"post","title":"Corrigindo schemas do Web Service Distribuição de DF-e da NF-e","published":true,"date":"2015-01-22T13:22:00.001-02:00","author":"Adriano dos Santos Fernandes","tags":["nf-e","java"],"modified_time":"2015-01-22T13:43:26.756-02:00"}},"__N_SSG":true}