{"pageProps":{"postData":{"id":["2010","12","14","problema-com-java-16022-e-nf-e-de-sp"],"contentHtml":"<p>Tivemos um problema, em ambiente interno de testes, com os webservices da Nota Fiscal Eletrônica do estado de São Paulo. O sistema estava sendo migrado de sistema operacional HP-UX (com Java distribuído pela HP) para um novo servidor com Red Hat Enterprise Linux (com Java da <s>Sun</s> Oracle).<div>Ao acessar os webservices a aplicação congelava ou dava erros de \"read timed out\". O primeiro passo foi verificar se o servidor estava acessando a internet normalmente. Através do elinks era possível acessar sites via http e https normalmente. O webservice retornava corretamente o erro de falta de certificado cliente.</div><div>Depois tentei fazer conexões pela aplicação adicionando \"?WSDL\" às URLs. Nem o ambiente de homologação nem o de produção da NF-e funcionavam. Outros endereços http funcionavam normalmente pela aplicação. Pra debugar o problema, adicionamos a opção -Djavax.net.debug=all. A requisição era enviada mas não vinha a resposta.</div><div>Resolvi fazer o teste com os webservices de contingência do SCAN e funcionou. Analisando os logs da conexão, resolvi procurar sobre o termo no_renegotiation que estava aparecendo quando acontecia o erro.</div><div><a href=\"http://www.oracle.com/technetwork/java/javase/documentation/tlsreadme2-176330.html\">Esta página</a> esclareceu o problema, que foi causado devido a uma alteração no Java para prevenir uma vulnerabilidade do protocolo TLS. Adicionamos as opções -Dsun.security.ssl.allowUnsafeRenegotiation=true e sun.security.ssl.allowLegacyHelloMessages=true até que o ambiente de SP seja atualizado.</div></p>\n","layout":"post","title":"Problema com Java 1.6.0_22 e NF-e de SP","date":"2010-12-14T19:18:00.006-02:00","author":"Adriano dos Santos Fernandes","tags":["nf-e","java"],"modified_time":"2010-12-14T21:00:41.264-02:00","blogger_id":"tag:blogger.com,1999:blog-3443854162607009076.post-5470221091873343313","blogger_orig_url":"http://asfernandes.blogspot.com/2010/12/problema-com-java-16022-e-nf-e-de-sp.html"}},"__N_SSG":true}