{"pageProps":{"postData":{"id":["2011","10","22","como-se-tornar-ou-nao-um-firebird"],"contentHtml":"<p>Recentemente eu divulguei em meu twitter que estava fazendo sete anos do meu primeiro commit no projeto Firebird. Daí citaram isso no FirebirdNews e em newsletter da Firebase.</p>\n<p>Estou dizendo isso porque apareceram algumas pessoas com aquele tipo comum de questionamento \"Como entrar para o time Firebird?\". O problema é que, como citado na newsletter da Firebase, desses sete anos pra cá nenhum desenvolvedor se juntou ao Firebird (core). Isso mesmo, com exceção de um ou outro patch específico (geralmente dos mantenedores das distros Linux), o Firebird é desenvolvido pelas mesmas poucas pessoas há mais de sete anos.</p>\n<p>Sempre respondi esses e-mails, mas geralmente a \"vontade\" da pessoa já termina aí. E olha que sempre respondi com mais educação do que estou usando pra escrever esse post.</p>\n<p>Então vou colocar o que realmente penso sobre isso. Em primeiro lugar, você não deve fazer essa pergunta \"Como entrar para o time Firebird?\". A primeira coisa é aprender a usar o Google e se surgir alguma dúvida que não tenha uma resposta, aí sim pergunte sobre ela.</p>\n<p>É normal que você tenha dificuldade pra \"se inserir\" no projeto. Eu comecei a acompanhar o desenvolvimento do Firebird em dezembro de 2003 e meu primeiro commit foi em setembro de 2004, apesar de estar trabalhando ativamente desde junho ou julho. O Claudio Valderrama costumava dizer que eu era o único que tinha aprendido o código em algumas semanas, mas como podem ver foi alguns meses 😃, sem falar que até hoje eu não gosto nem de ver certos subsistemas (hello PAG, CCH, SDW...).</p>\n<p>Outra coisa são suas habilidades. Não é normal que você não tenha no mínimo bons conhecimentos sobre C++, que é a linguagem usada no desenvolvimento do Firebird. Eu posso te afirmar com 98% de certeza que você não vai encontrar em um projeto open-source pessoas com vontade de te ajudar com coisas básicas.</p>\n<p>Digamos que você já esteja pensando que não quer isso (como todos os anteriores), mas tenha alguma dúvida ainda, então continuo minhas sugestões para que você não consiga 😃. Não leia todos os posts das listas de discussões. Também não leia e tente entender todas as alterações feitas no código, que são enviadas pra lista firebird-checkins. Acho que foi aqui que falhei, pois desde aquele dezembro de 2003 não deixei de ler nenhuma das milhares de mensagens. E tenho certeza que todos os outros desenvolvedores ativos fizeram e fazem o mesmo.</p>\n<p>Se você também se ofendeu com esse post (caso tenha sido um dos que fez aquela pergunta), é melhor não perder seu tempo e desistir logo. Quem acompanha as listas firebird-devel e firebird-architect (e a firebird-admins, mas essa é fechada), sabe do que estou falando. As vezes (pra não dizer, muitas vezes) as discussões partem pro lado pessoal, e isso é a pior parte de fazer parte do projeto. Isso não é uma exclusividade do Firebird. Comparando com o Linux, por exemplo, é só procurar alguma mensagem do Linus Torvals na lkml e ver como a coisa geralmente funciona.</p>\n","layout":"post","title":"Como se tornar (ou não) um \"Firebird Developer\"","published":false,"date":"2011-10-22T01:15:00.001-02:00","author":"Adriano dos Santos Fernandes","tags":["firebird"],"modified_time":"2011-10-22T01:15:44.700-02:00","blogger_id":"tag:blogger.com,1999:blog-3443854162607009076.post-458796742082581529","blogger_orig_url":"http://asfernandes.blogspot.com/2011/10/como-se-tornar-ou-nao-um-firebird.html"}},"__N_SSG":true}